In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries.csv')

In [3]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [5]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

In [6]:
df[['Name', 'Salary']]

     Name  Salary
0    John   50000
1   Sally  120000
2  Alyssa   80000

Since Pandas is built on top of Numpy, then you can access Numpy methods.

In [ ]:
df['Salary'].max()

In [8]:
df['Salary'] > 60000

0    False
1     True
2     True
Name: Salary, dtype: bool

In [9]:
df[df['Salary'] > 60000]

     Name  Salary  Age
1   Sally  120000   45
2  Alyssa   80000   27